In [ ]:
import pandas as pd #Removing rows with NaN values

df = pd.read_csv('Sales.csv')

new_df = df.dropna()

print(new_df.to_string())

   Order ID Customer Name   Order Date   Product  Quantity  Unit Price  Total Revenue
0      1001      John Doe   01/01/2024  Widget A      10.0        25.0          250.0
1      1002    Jane Smith   01/02/2024  Widget B       5.0        40.0          200.0
4      1005     Bob Brown  2024/01/05'  Widget B      10.0        40.0          400.0
5      1006      John Doe   06/01/2024  Widget A       4.0        25.0          100.0
6      1001      John Doe   01/01/2024  Widget A      10.0        25.0          250.0
7      1007    Jane Smith   07/01/2024  Widget C      -6.0        70.0         -420.0

In [ ]:
import pandas as pd
#adjusting date format
df = pd.read_csv('Sales.csv')

df['Order Date'] = pd.to_datetime(df['Order Date'], format='mixed')

print(df.to_string())

   Order ID  Customer Name Order Date   Product  Quantity  Unit Price  Total Revenue
0      1001       John Doe 2024-01-01  Widget A      10.0        25.0          250.0
1      1002     Jane Smith 2024-01-02  Widget B       5.0        40.0          200.0
2      1003            NaN 2024-01-03  Widget A       NaN        25.0            NaN
3      1004  Alice Johnson 2024-04-01  Widget C       3.0         NaN          210.0
4      1005      Bob Brown 2024-01-05  Widget B      10.0        40.0          400.0
5      1006       John Doe 2024-06-01  Widget A       4.0        25.0          100.0
6      1001       John Doe 2024-01-01  Widget A      10.0        25.0          250.0
7      1007     Jane Smith 2024-07-01  Widget C      -6.0        70.0         -420.0

In [3]:
df.drop_duplicates()

,Order ID,Customer Name,Order Date,Product,Quantity,Unit Price,Total Revenue
0,1001,John Doe,2024-01-01,Widget A,10.0,25.0,250.0
1,1002,Jane Smith,2024-01-02,Widget B,5.0,40.0,200.0
2,1003,NaN,2024-01-03,Widget A,NaN,25.0,NaN
3,1004,Alice Johnson,2024-04-01,Widget C,3.0,NaN,210.0
4,1005,Bob Brown,2024-01-05,Widget B,10.0,40.0,400.0
5,1006,John Doe,2024-06-01,Widget A,4.0,25.0,100.0
7,1007,Jane Smith,2024-07-01,Widget C,-6.0,70.0,-420.0